const binarySearch = require("./task/task_03");

describe("Проверка бинарного поиска", () => {
  const testCase = [
    {
      arr: [-10, -5, -4, -3, -2, -1],
      key: -3,
      expected: 3,
    },
    {
      arr: ["a", "b", "c"],
      key: "b",
      expected: 1,
    },
    {
      arr: [],
      key: 12,
      expected: -1,
    },
    {
      arr: [1, 2, 3, 4, 5],
      key: null,
      expected: -1,
    },
    {
      arr: [
        0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597,
        2584, 4181, 6765, 10946, 17711, 28657, 46368, 75025, 121393, 196418,
        317811, 514229, 832040, 1346269, 2178309, 3524578, 5702887, 9227465,
        14930352, 24157817, 39088169, 63245986, 102334155, 165580141, 267914296,
        433494437, 701408733, 1134903170, 1836311903, 2971215073, 4807526976,
        7778742049, 12586269025,
      ],
      key: 2971215073,
      expected: 47,
    },
  ];
  testCase.forEach((item) => {
    it(`Массив: [${item.arr}] и ключа: ${item.key}`, () => {
      const res = binarySearch(item.arr, item.key);
      expect(res).toEqual(item.expected);
    });
  });
});
